set schema DB2PC;

-- Напишете заявка, която извежда номер на модел, честота и размер на диска за
-- всички компютри с цена по-малка от 1200 долара. Задайте псевдоними за
-- атрибутите честота и размер на диска, съответно MHz и GB.
select model, speed as MHz, hd as GB from PC
where price < 1200;

-- Напишете заявка, която извежда всички производители на принтери без повторения.
select distinct maker from Product
where type = 'Printer';

-- Напишете заявка, която извежда номер на модел, размер на паметта, размер на
-- екран за лаптопите, чиято цена е по-голяма от 1000 долара.
select model, RAM, screen from Laptop
where price > 1000;

-- Напишете заявка, която извежда всички цветни принтери.
select * from Printer
where color = 'y';

-- Напишете заявка, която извежда номер на модел, честота и размер на диска за
-- тези компютри с CD 12x или 16x и цена по-малка от 2000 долара.
select model, speed, hd from PC
where CD in ('12x', '16x') and price < 2000;