// Автор: Майкъл Зарков
// Лекция 1

// Въведение в изброения тиб (enum) и в структурата (struct)


/*
	Преговор на типовете данни:
		- фундаментални(примитивни) типове данни, предостанени ни от езика C++
			 - int, unsigned (long, short)
			 - double, float
			 - char
			 - bool
		- съставни типове данни
			- указателите (pointers)
			- функции (също се водят съставен тип данни)	|
			- изброеният тип данни enum						| = > тези типове са дефинирани от потребителя (user defined types)
			- структури и класове							|
*/

/* 
	Enum:
	-използваме го за изброимо множество от константи
	- прави кода по - четлив, защото подобните константи са на едно място и са именовани
	- обикновено имената на константите ги пишем с главни букви
	- лесно се ползва със switch и масиви (защото константите са от тип int)
 
	- обикновено в двата края слагаме такива граници (UNDEFINED, C_COUNT),
	  за да знаем, че константите са между тях като числова стойност. !!! Тези граници са МНОГО полезно нещо !!!
	- можем ръчно да зададем стойността на константите (GREEN = 5). Ако не е зададена стойност всяка следваща константа
	  е с едно по-голяма от предходната !!! Това ни ГАРАНТИРА, че константите ще са между двете граници като стойност !!!
	  (разбира се границите ТРЯБВА да са на първа и последна позиция)
	  (UNDEFINED = -1, за да започне първата ни "истинска" константа от нулата)
	  (ако на първата константа не е дадена стойност, то тя е нула)
	  (може да има две константи с една и съща стойност. Може това умишлено да го направин поради някаква причина)

	Note: на компилатора не му харесва, ако две константи в два различни изброени типа са с едно и също име
*/
enum Colour
{
	UNDEFINED = -1,

	WHITE,
	BLACK,
	GREEN = 5,			 

	C_COUNT

	// В случая константите ще имат стойности: UNDEFINED = -1, WHITE = 0, BLACK = 1, GREEEN = 5, C_COUNT = 6 
};


// Тук L_COUNT ще представлява броя на Level-ите дори и да добавим нови (L_FOUR, L_FIVE ...)
enum Level
{
	L_UNDEFINED= -1,	
	
	L_ONE,
	L_TWO,
	L_THREE,

	L_COUNT
};


/* 
	НЕ можем да въвеждаме enum със std::cin.
	Вариантите за въвеждане са:
		- четем низ и задаваме стойност според низа
		- четем число и задаваме стойност според числото
*/

// Можем и да сменим типа на константите така:
enum MyEnum1 : short { ZERO1, ONE1, TWO1 };
enum MyEnum2 : bool { ZERO2, ONE2, TWO2 };
// НЕ може double: enum MyEnum3 : double {};


// Можем така да задаваме стойности на променливите:
Colour MyColour = GREEN;
MyColour = Colour::BLACK;